---
type: FamilyInstanceFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# FamilyInstanceFilter

`Autodesk.Revit.DB.FamilyInstanceFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FamilyInstanceFilter | 2011 | `public FamilyInstanceFilter ( Document document , ElementId familySymbolId )` |
| Method | PassesFilter | — | `` |
| Property | FamilySymbolId | 2011 | `public ElementId FamilySymbolId { get ; }` |